In [3]:
# List of high schools 
high_schools = [ "Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [11]:
# dictionary of high schools and the type of school
high_school_types = [{"High School": "Griffin", "Type":"District"},
                     {"High School": "Figueroa", "Type":"District"},
                     {"High School": "Wilson", "Type":"Charter"},
                     {"High School": "Wright", "Type":"Charter"}]
for school in high_school_types:
   print(school)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [16]:
# List of high schools
high_schools =["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]
#print (high_schools)

In [17]:
# add the pandas dependency 
import pandas as pd

In [19]:
# Create a Pandas Series from a list 
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [23]:
# A distionary of high schools 
high_school_dicts = [{"School ID": 0, "school_name":"Huang High School", "type":"District"},
                     {"School ID": 1, "school_name":"Figueroa High School", "type":"District"},
                     {"School ID": 2, "school_name":"Shelton High School", "type":"Charter"},
                     {"School ID": 3, "school_name":"Hernandez High School", "type":"District"},
                     {"School ID": 4, "school_name":"Griffin High School", "type":"Charter"}]

In [24]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [41]:
# Three separate lists of information on high schools
school_id =[0,1,2,3,4]
school_name =["Huang High School","Figueroa High School","Shelton High School","Hernandez High School","Griffin High School"]

type_of_school = ["District","District","Charter","District","Charter"]

In [42]:
# Initialize a new DataFrame
schools_df =pd.DataFrame()

In [43]:
# Add the list to a new dataframe 
schools_df["School ID"]= school_id
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [49]:
schools_df["School Name"]= school_name 
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [50]:
schools_df["Type"]= type_of_school 
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [51]:
school_df.columns

Index([], dtype='object')

In [52]:
school_df.index

Index([], dtype='object')

In [58]:
school_df.values

array([], shape=(0, 0), dtype=float64)

In [63]:
import pandas as pd
import os

student_data =os.path.join('Resources','new_student_data.csv')
student_df =pd.read_csv(student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [64]:
student_df["student_name"]

0            Sarah Douglas
1        Francisco Osborne
2                Ryan Haas
3             Kathryn Mack
4          Harold Reynolds
               ...
13935          Kelly Myers
13936       Kimberly Burke
13937      Crystal Merritt
13938        Misty Wiggins
13939        Michele Jones
Name: student_name, Length: 13940, dtype: object